{"id":52,"date":"2019-10-08T02:41:00","date_gmt":"2019-10-08T02:41:00","guid":{"rendered":"https:\/\/oilsnetwork.wpengine.com\/?page_id=52"},"modified":"2019-11-19T20:10:59","modified_gmt":"2019-11-19T20:10:59","slug":"why-doterra","status":"publish","type":"page","link":"https:\/\/oilsnetwork.com\/why-doterra\/","title":{"rendered":"Why doTERRA"},"content":{"rendered":"<h2>\n\t\tWhy doTERRA?\n\t<\/h2>\n\t<iframe loading=\"lazy\" src=\"https:\/\/player.vimeo.com\/video\/369492300?title=0&#038;byline=0&#038;portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen><\/iframe>\n<h2>\n\t\tPure Essential Oils\n\t<\/h2>\n\t<p>If you’re wondering where to buy essential oils, you don’t have to look far.<\/p>\n<p>However, be careful where you look, because many essential oils on the market are heavily contaminated or adulterated with synthetic chemicals. If you’re buying essential oils, it means you want something completely natural and safe. Make sure that you don’t inadvertently buy something you think is natural but turns out to be synthetic.<\/p>\n<p>When you want essential oils that are safe and effective, the most important thing to look for is purity. Pure essential oils will allow you to reap the full benefits that nature has to offer, and you can be confident knowing that they are safe to use to use with your family. Remember, you usually get what you pay for, and essential oils are no different.<\/p>\n\t\t\t\t<img loading=\"lazy\" src=\"https:\/\/oilsnetwork.com\/wp-content\/uploads\/2019\/10\/essential-oils-1.png\" alt=\"essential oils\" itemprop=\"image\" height=\"442\" width=\"348\" title=\"essential-oils\" onerror=\"this.style.display='none'\"  \/>\n<h2>\n\t\tWhat to Look for When Buying Essential Oils\n\t<\/h2>\n\t<p>In a market where every company claims to have “pure” essential oils, how do you really know if the oils you’re using are pure? How do you know if the essential oils you’re buying are worthy of being used by you and your family?<\/p>\n<p>If you want the best essential oils, find out if the company you plan to buy from takes the following precautions to ensure the quality of their oils:<\/p>\n\t<ul>\n<li>Sustainable and responsible sourcing (Where do their oils come from?)<\/li>\n<li>Extensive and thorough testing (Do they test their oils for adulteration and contamination?)<\/li>\n<li>Clear and accessible safety and usage information (Do they show customers how to use the oils safely?)<\/li>\n<li>Transparency (Do they use third-party testing? Do they make test results public?)<\/li>\n<\/ul>\n\t\t\t\t<img loading=\"lazy\" src=\"https:\/\/oilsnetwork.com\/wp-content\/uploads\/2019\/10\/what-makes-doterra-different.png\" alt=\"what makes doterra different\" itemprop=\"image\" height=\"500\" width=\"500\" title=\"what-makes-doterra-different\" onerror=\"this.style.display='none'\"  \/>\n<h2>\n\t\tWhat Makes doTERRA Different?\n\t<\/h2>\n\t<p>When you use a bottle of doTERRA essential oil, you’re using an oil that is pure. There are no contaminants, fillers, or adulterations. The essential oil industry did not have standards to ensure purity, so doTERRA created one.<\/p>\n<p>Every batch of doTERRA essential oils goes through a rigorous testing process—well beyond what would be considered “good enough.” After that, each oil is sent to an independent third party for further testing and validation.<\/p>\n<h3>\n\t\tPure Essential Oils Pass Tests\n\t<\/h3>\n\t<p>If the oil passes the tests, it’s labeled as CPTG Certified Pure Therapeutic Grade®. When you see the CPTG® label, you know you’re using the purest essential oils on the market.<\/p>\n<p>Want to see the purity of doTERRA oils for yourself? Every single bottle of doTERRA oil comes with a quality ID. Use the ID number on the bottom of your bottle to view the third-party test results for that batch of oil by clicking below:<\/p>\n<h3>\n\t\tMore than Essential Oils \n\t<\/h3>\n\t<p>It’s more than just testing that sets doTERRA essential oils apart. doTERRA works diligently to make a difference. Our mission is to change the world one drop, one person, one community at a time.<\/p>\n<h2>\n\t\tWhere do doTERRA essential oils come from? \n\t<\/h2>\n\t<p>Every oil sold by doTERRA is responsibly and sustainably sourced. doTERRA focuses on sourcing practices that will produce only the highest quality essential oils—no matter the cost. We make it a top priority to protect the environment during the production process and provide fair treatment of all harvesters and growers.<\/p>\n<p>doTERRA created the Co-Impact Sourcing® Initiative and the following 8 principles to ensure responsible practices in all our sourcing communities:<\/p>\n\t\t\t\t<img loading=\"lazy\" src=\"https:\/\/oilsnetwork.com\/wp-content\/uploads\/2019\/10\/Healing-hands.png\" alt=\"Healing hands\" itemprop=\"image\" height=\"300\" width=\"500\" title=\"Healing hands\" onerror=\"this.style.display='none'\"  \/>\n\t<ol>\n<li><strong>Generating Jobs:<\/strong> Reduce poverty by creating and sustaining jobs<\/li>\n<li><strong>Providing Fair, On-Time Payments:<\/strong> Offer consistent, fair payments to producers, including prepayments<\/li>\n<li><strong>Building Supplier Capacity:<\/strong> Support farmers, producers, and distillers through training and financial support<\/li>\n<li><strong>Sustaining Long-Term Partnerships:<\/strong> Provide multi-year contracts with growers and distillers based on solidarity and respect<\/li>\n<li><strong>Ensuring Fair Labor Conditions:<\/strong> Create healthy and safe working environments, free from harassment and discrimination<\/li>\n<li><strong>Promoting Cooperatives: <\/strong>Guarantee respect the right for all employees and producers to join and form co-operatives<\/li>\n<li><strong>Furthering Environmental Stewardship:<\/strong> Promote energy efficient technologies, renewable energy, and waste minimization<\/li>\n<li><strong>Facilitating Community Development:<\/strong> Support community development projects in sourcing communities such as schools, health clinics, training facilities, and clean water systems<\/li>\n<\/ol>\n<h2>\n\t\tHumanitarian Impact\n\t<\/h2>\n\t<p>From the beginning, doTERRA wanted to be more than a business. “There are givers and there are takers,” said David Stirling, doTERRA Founding Executive, CEO. “We wanted doTERRA to be a giver.”<\/p>\n<p>To accomplish that, the doTERRA Healing Hands Foundation® was created—a 501(c)(3) nonprofit that helps support community development projects in sourcing communities. These kinds of projects include funding for and building of schools, health clinics, training facilities, and clean water systems.<\/p>\n\t<iframe loading=\"lazy\" src=\"https:\/\/player.vimeo.com\/video\/369491811?title=0&#038;byline=0&#038;portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen><\/iframe>\n\t\t\t\t<img loading=\"lazy\" src=\"https:\/\/oilsnetwork.com\/wp-content\/uploads\/2019\/10\/eco-beauty-editor-doterra-healing-hands-nepal.jpg\" alt=\"eco-beauty-editor-doterra-healing-hands-nepal\" itemprop=\"image\" height=\"305\" width=\"483\" title=\"eco-beauty-editor-doterra-healing-hands-nepal\" onerror=\"this.style.display='none'\"  \/>\n\t<p>The doTERRA Healing Hands Foundation also partners with a variety of other organizations to support disaster relief; anti-human trafficking prevention, rescue, and rehabilitation; microloan programs; and feminine hygiene education.<\/p>\n<p>doTERRA generously donates to cover all administrative costs of the foundation so that 100% of all donations go directly to aid. When you partner with the doTERRA Healing Hands Foundation, your donation could save a child from human trafficking, repair a home devastated by a natural disaster, or help provide someone with access to healthcare.<\/p>\n<h2>\n\t\tReady to Join doTERRA?\n\t<\/h2>\n\t\t\t<a href=\"https:\/\/www.doterra.com\/US\/en\/selectRegion\/WC\/37049\" role=\"button\" target=\"_self\" rel=\"noopener noreferrer\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWellness Advocate\n\t\t\t\t\t\t\t<\/a>\n\t\t\t<a href=\"https:\/\/www.doterra.com\/US\/en\/selectRegion\/WC\/37049\" role=\"button\" target=\"_self\" rel=\"noopener noreferrer\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWholesale Customer\n\t\t\t\t\t\t\t<\/a>\n","protected":false},"excerpt":{"rendered":"<p>Why doTERRA? Pure Essential Oils If you’re wondering where to buy essential oils, you don’t have to look far. However, be careful where you look, because many essential oils on the market are heavily contaminated or adulterated with synthetic chemicals. If you’re buying essential oils, it means you want something completely natural and safe. Make [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-builder.php","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":""},"yst_prominent_words":[],"_links":{"self":[{"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/pages\/52"}],"collection":[{"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/comments?post=52"}],"version-history":[{"count":0,"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/pages\/52\/revisions"}],"wp:attachment":[{"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/media?parent=52"}],"wp:term":[{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/oilsnetwork.com\/wp-json\/wp\/v2\/yst_prominent_words?post=52"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}